In [1]:
pip install openpyxl

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: openpyxl in c:\users\shreyash\appdata\roaming\python\python311\site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in c:\users\shreyash\appdata\roaming\python\python311\site-packages (from openpyxl) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

DEPRECATION: Loading egg at c:\program files\python311\lib\site-packages\vboxapi-1.0-py3.11.egg is deprecated. pip 24.3 will enforce this behaviour change. A possible replacement is to use pip for package installation.. Discussion can be found at https://github.com/pypa/pip/issues/12330
DEPRECATION: google-images-search 1.4.6 has a non-standard dependency specifier click>=7.0<=8.1.*. pip 24.1 will enforce this behaviour change. A possible replacement is to upgrade to a newer version of google-images-search or contact the author to suggest that they release a version with a conforming dependency specifiers. Discussion can be found at https://github.com/pypa/pip/issues/12063

In [2]:
# Programmer : Shreyash Dhomkar
# College : Keystone SOE
# Class : TE
# Roll No : 57

In [3]:
# pandas -> structured data analysis
import pandas as pd
# numpy -> array operations
import numpy as np

## Array

In [4]:
num = np.array([34,12,37,49,15,73,88])

In [5]:
num

array([34, 12, 37, 49, 15, 73, 88])

In [6]:
type(num)

numpy.ndarray

In [7]:
num.dtype

dtype('int32')

In [8]:
num = np.array([34,12,37,49,15,73,88], dtype=np.int16)

In [9]:
num

array([34, 12, 37, 49, 15, 73, 88], dtype=int16)

In [10]:
num.dtype

dtype('int16')

In [11]:
num[2]

37

## Series

In [12]:
s = pd.Series([45,12,38,75,19,36])

In [13]:
s

0    45
1    12
2    38
3    75
4    19
5    36
dtype: int64

In [14]:
type(s)

pandas.core.series.Series

In [15]:
s.dtype

dtype('int64')

In [16]:
s.size

6

In [17]:
s.shape

(6,)

In [18]:
s = pd.Series([45,12,38,75,19,36], index=range(100,106))

In [19]:
s

100    45
101    12
102    38
103    75
104    19
105    36
dtype: int64

In [20]:
s[105]

36

In [21]:
r = pd.Series([1,2,3,4,5])
n = pd.Series(['prem','raj','kiran','priya','asha'])
m = pd.Series([67.89,73.57,71.90,67.34,66.66])

In [22]:
df = pd.DataFrame({
    'roll': r,
    'name': n,
    'marks': m
})

In [23]:
df

   roll   name  marks
0     1   prem  67.89
1     2    raj  73.57
2     3  kiran  71.90
3     4  priya  67.34
4     5   asha  66.66

In [24]:
df.shape

(5, 3)

In [25]:
df.size

15

In [26]:
df.dtypes

roll       int64
name      object
marks    float64
dtype: object

In [27]:
type(df)

pandas.core.frame.DataFrame

## Structured Data Analysis

 Downloading datasets starting with students from 
 https://mitu.co.in/dataset

In [28]:
import os
os.getcwd()

'C:\\Users\\shreyash\\Documents\\data science'

## Import data set

In [29]:
df = pd.read_csv('student.csv')

In [30]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [31]:
df1 = pd.read_csv('student1.csv')

In [32]:
df1

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [33]:
cols = ['A','B','C','D','E']

In [34]:
df1 = pd.read_csv('student1.csv', names=cols)

In [35]:
df1

    A        B   C      D   E
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [36]:
df3 = pd.read_csv('student3.tsv')

In [37]:
df3

  roll\tname\tclass\tmarks\tage
0        1\tanil\tTE\t56.77\t22
1        2\tamit\tTE\t59.77\t21
2      3\taniket\tBE\t76.88\t19
3     4\tajinkya\tTE\t69.66\t20
4        5\tasha\tTE\t63.28\t20
5      6\tayesha\tBE\t49.55\t20
6        7\tamar\tBE\t65.34\t19
7       8\tamita\tBE\t68.33\t23
8        9\tamol\tTE\t56.75\t20
9      10\tanmol\tBE\t78.66\t21

In [38]:
df3 = pd.read_csv('student3.tsv', sep='\t')
df3

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [39]:
# read from link
df2 = pd.read_csv('https://gist.githubusercontent.com/justimchung/9b98c69b30600a46daa6d2e827c31b56/raw/4b1f08ba9b00a2fcd3f7ced9cf9e59062f489c3a/student.csv')

In [40]:
df2

  Unnamed: 0    Name  height  weight  sex       bdate       city major
0   s1234567   Peter   175.0   70.45    1   1980/4/30     Tainan  CSIE
1   e1234567    Mary   163.0   55.00    2  1981/12/21     Taipei    EE
2   f1357689    John   180.4   80.30    1   1980/5/30     Tainan  Stat
3   e1374659   Keven   182.5   77.60    1  1980/11/19     Taipei    EE
4   s7758347    JoJo   170.3   50.30    2   1980/1/27     Taipei  CSIE
5   s1334987   Emily   168.5   53.60    2  1982/10/13  Kaohsiung  CSIE
6   e1384726  Ubuntu   177.0   68.30    1    1981/7/6  Kaohsiung    EE

In [41]:
dfx = pd.read_excel('student.xlsx')

In [42]:
dfx

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [43]:
df.shape

(10, 5)

In [44]:
df.size

50

In [45]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [46]:
df.dtypes

roll       int64
name      object
class     object
marks    float64
age        int64
dtype: object

In [47]:
df.ndim

2

In [48]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [49]:
df.T

,0,1,2,3,4,5,6,7,8,9
roll,1,2,3,4,5,6,7,8,9,10
name,anil,amit,aniket,ajinkya,asha,ayesha,amar,amita,amol,anmol
class,TE,TE,BE,TE,TE,BE,BE,BE,TE,BE
marks,56.77,59.77,76.88,69.66,63.28,49.55,65.34,68.33,56.75,78.66
age,22,21,19,20,20,20,19,23,20,21

## Functions and methods

In [50]:
df.head()

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20

In [51]:
df.tail()

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [52]:
df.tail(2)

   roll   name class  marks  age
8     9   amol    TE  56.75   20
9    10  anmol    BE  78.66   21